* No derailment (Move between segments)
** Elapsed time
|-------------------------+----------+----------+----------+--------------|
| Configuration           |    First |   Second |    Third |      Average |
|-------------------------+----------+----------+----------+--------------|
| Example with one train  |    0.009 |    0.008 |    0.009 | 8.6666667e-3 |
| Example with two trains |    0.056 |    0.069 |    0.068 |  0.064333333 |
| Shared Segment          |    0.033 |    0.040 |    0.041 |        0.038 |
| Large Network           |    0.022 |    0.031 |    0.047 |  0.033333333 |
| Station One             |    0.032 |    0.037 |    0.038 |  0.035666667 |
| Station Two             |    0.316 |    0.404 |    0.374 |   0.36466667 |
| Station Four            |   12.138 |   11.746 |   11.241 |    11.708333 |
| Station Six             |  254.857 |  253.484 |  255.691 |    254.67733 |
| Station Eight           | 1658.055 | 1580.792 | 1545.470 |    1594.7723 |
| Station Ten             | 6293.598 | 6145.904 | 6052.362 |    6163.9547 |
| Nærumbanen (2T)         |  132.497 |  131.916 |  133.614 |    132.67567 |
| Nærumbanen (3T)         | 4627.806 | 4562.283 | 4565.455 |    4585.1813 |
|-------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+----------+----------+----------+-----------|
| Configuration           |    First |   Second |    Third |   Average |
|-------------------------+----------+----------+----------+-----------|
| Example with one train  |    9.296 |    9.320 |    9.324 | 9.3133333 |
| Example with two trains |   10.116 |   10.132 |   10.144 | 10.130667 |
| Shared Segment          |   11.644 |   11.936 |   12.212 | 11.930667 |
| Large Network           |   13.876 |   13.924 |   13.940 | 13.913333 |
| Station One             |   10.052 |   10.068 |   10.080 | 10.066667 |
| Station Two             |   16.324 |   16.388 |   16.396 | 16.369333 |
| Station Four            |   59.620 |   59.884 |   59.900 | 59.801333 |
| Station Six             |  211.792 |  212.548 |  212.528 | 212.28933 |
| Station Eight           |  540.852 |  542.156 |  542.156 | 541.72133 |
| Station Ten             | 1177.352 | 1177.396 | 1179.200 | 1177.9827 |
| Nærumbanen (2T)         |  152.988 |  154.016 |  154.132 |   153.712 |
| Nærumbanen (3T)         | 1303.376 | 1303.416 | 1303.432 |  1303.408 |
|-------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Critical section)
** Elapsed time
|-------------------------+----------+----------+----------+--------------|
| Configuration           |    First |   Second |    Third |      Average |
|-------------------------+----------+----------+----------+--------------|
| Example with one train  |    0.003 |    0.006 |    0.007 | 5.3333333e-3 |
| Example with two trains |    0.061 |    0.052 |    0.067 |         0.06 |
| Shared Segment          |    0.031 |    0.031 |    0.052 |        0.038 |
| Large Network           |    0.029 |    0.032 |    0.034 |  0.031666667 |
| Station One             |    0.030 |    0.016 |    0.021 |  0.022333333 |
| Station Two             |    0.351 |    0.402 |    0.350 |   0.36766667 |
| Station Four            |   11.451 |   11.260 |   10.112 |       10.941 |
| Station Six             |  257.545 |  239.275 |  240.982 |      245.934 |
| Station Eight           | 1757.166 | 1660.574 | 1666.525 |     1694.755 |
| Station Ten             | 6251.048 | 6112.542 | 6116.494 |     6160.028 |
| Nærumbanen (2T)         |  132.551 |  134.115 |  133.177 |      133.281 |
| Nærumbanen (3T)         | 4328.896 | 4311.326 | 4319.310 |     4319.844 |
|-------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+----------+----------+----------+-----------|
| Configuration           |    First |   Second |    Third |   Average |
|-------------------------+----------+----------+----------+-----------|
| Example with one train  |    7.656 |    7.668 |    7.672 | 7.6653333 |
| Example with two trains |   10.448 |   10.472 |   10.480 | 10.466667 |
| Shared Segment          |    9.948 |    9.976 |    9.980 |     9.968 |
| Large Network           |   11.948 |   11.996 |   12.008 |    11.984 |
| Station One             |    8.396 |    8.424 |    8.428 |     8.416 |
| Station Two             |   15.408 |   15.456 |   15.464 | 15.442667 |
| Station Four            |   58.064 |   58.308 |   58.316 | 58.229333 |
| Station Six             |  208.876 |  209.304 |  209.308 | 209.16267 |
| Station Eight           |  542.196 |  543.516 |  543.516 |   543.076 |
| Station Ten             | 1178.508 | 1178.568 | 1178.036 | 1178.3707 |
| Nærumbanen (2T)         |  151.420 |  152.436 |  152.560 | 152.13867 |
| Nærumbanen (3T)         | 1303.352 | 1303.392 | 1303.392 | 1303.3787 |
|-------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
|-------------------------+----------+----------+----------+--------------|
| Configuration           |    First |   Second |    Third |      Average |
|-------------------------+----------+----------+----------+--------------|
| Example with one train  |    0.006 |    0.006 |    0.007 | 6.3333333e-3 |
| Example with two trains |    0.034 |    0.035 |    0.063 |        0.044 |
| Shared Segment          |    0.018 |    0.037 |    0.033 |  0.029333333 |
| Large Network           |    0.024 |    0.029 |    0.040 |        0.031 |
| Station One             |    0.018 |    0.017 |    0.019 |        0.018 |
| Station Two             |    0.306 |    0.398 |    0.349 |        0.351 |
| Station Four            |   12.486 |   10.081 |   12.083 |        11.55 |
| Station Six             |  252.827 |  246.848 |  249.513 |    249.72933 |
| Station Eight           | 1625.016 | 1620.067 | 1548.218 |     1597.767 |
| Station Ten             | 6219.558 | 5960.382 | 6024.153 |     6068.031 |
| Nærumbanen (2T)         |  133.816 |  133.661 |  133.648 |    133.70833 |
| Nærumbanen (3T)         | 4380.034 | 4368.982 | 4373.205 |    4374.0737 |
|-------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+----------+----------+----------+-----------|
| Configuration           |    First |   Second |    Third |   Average |
|-------------------------+----------+----------+----------+-----------|
| Example with one train  |    7.648 |    7.660 |    7.660 |     7.656 |
| Example with two trains |    8.420 |    8.428 |    8.436 |     8.428 |
| Shared Segment          |    9.924 |    9.956 |   10.216 |    10.032 |
| Large Network           |   11.948 |   12.000 |   12.008 | 11.985333 |
| Station One             |    8.404 |    8.412 |    8.420 |     8.412 |
| Station Two             |   14.920 |   14.976 |   14.984 |     14.96 |
| Station Four            |   58.036 |   58.280 |   58.288 | 58.201333 |
| Station Six             |  209.552 |  210.308 |  210.312 | 210.05733 |
| Station Eight           |  543.948 |  544.996 |  545.256 | 544.73333 |
| Station Ten             | 1176.496 | 1177.572 | 1178.464 | 1177.5107 |
| Nærumbanen (2T)         |  151.368 |  152.404 |  152.424 | 152.06533 |
| Nærumbanen (3T)         | 1303.336 | 1303.388 | 1303.408 | 1303.3773 |
|-------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
|-------------------------+----------+----------+----------+--------------|
| Configuration           |    First |   Second |    Third |      Average |
|-------------------------+----------+----------+----------+--------------|
| Example with one train  |    0.007 |    0.005 |    0.005 | 5.6666667e-3 |
| Example with two trains |    0.063 |    0.054 |    0.063 |         0.06 |
| Shared Segment          |    0.018 |    0.017 |    0.020 |  0.018333333 |
| Large Network           |    0.023 |    0.042 |    0.038 |  0.034333333 |
| Station One             |    0.018 |    0.029 |    0.030 |  0.025666667 |
| Station Two             |    0.300 |    0.318 |    0.401 |   0.33966667 |
| Station Four            |   12.274 |   10.647 |   12.419 |        11.78 |
| Station Six             |  259.847 |  261.048 |  261.756 |    260.88367 |
| Station Eight           | 1670.962 | 1697.476 | 1604.006 |    1657.4813 |
| Station Ten             | 6131.157 | 5857.906 | 5887.561 |    5958.8747 |
| Nærumbanen (2T)         |  131.425 |  130.869 |  132.489 |    131.59433 |
| Nærumbanen (3T)         | 4587.688 | 4593.748 | 4603.034 |    4594.8233 |
|-------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+----------+----------+----------+-----------|
| Configuration           |    First |   Second |    Third |   Average |
|-------------------------+----------+----------+----------+-----------|
| Example with one train  |    7.584 |    7.592 |    7.592 | 7.5893333 |
| Example with two trains |    8.348 |    8.348 |    8.348 |     8.348 |
| Shared Segment          |    9.860 |    9.880 |    9.884 | 9.8746667 |
| Large Network           |   11.860 |   11.900 |   11.904 |    11.888 |
| Station One             |    8.332 |    8.332 |    8.332 |     8.332 |
| Station Two             |   15.332 |   15.376 |   15.384 |    15.364 |
| Station Four            |   58.804 |   58.980 |   58.996 | 58.926667 |
| Station Six             |  205.536 |  205.880 |  205.900 |   205.772 |
| Station Eight           |  542.224 |  543.556 |  543.556 |   543.112 |
| Station Ten             | 1172.864 | 1172.864 | 1172.880 | 1172.8693 |
| Nærumbanen (2T)         |  151.304 |  152.240 |  152.248 | 151.93067 |
| Nærumbanen (3T)         | 1303.276 | 1303.312 | 1303.312 |    1303.3 |
|-------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)
